Infineon/Code-Examples-for-the-ModusToolbox-PSoC-6-SDK/CE225909_PSoC6_BatteryLevel_RTOS/GeneratedSource/cycfg_ble.h
/***************************************************************************//**
* File Name: cycfg_ble.h
* Version: 1.1
*
* Description:
* Bluetooth Low Energy (BLE) milddleware configuration.
* This file should not be modified. It was automatically generated by
* Bluetooth Configurator 1.1.0 build 291
*
********************************************************************************
* Copyright 2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#if !defined(CYCFG_BLE_H)
#define CYCFG_BLE_H

#include "cycfg_peripherals.h"
#include "cy_syslib.h"


#if !defined(CY_BLE_CORE)
#error Target CPU core is not set: missing #define CY_BLE_CORE
#endif


#if (CY_BLE_CORE == CY_BLE_CORE_DUAL) || (CY_BLE_CORE == __CORTEX_M)

#include "cy_ble_event_handler.h"
#include "cy_ble_defines.h"
#include "cy_ble_common.h"


/** 
 * The maximum number of BLE connections
 * This parameter displays how many BLE connections (both Central and Peripheral) are allowed.
 * The valid range is from 1 to 4.
 */
#define CY_BLE_CONN_COUNT                           (0x01u)

/** The number of BLE connections (client) */
#define CY_BLE_GATTC_COUNT                          (0x00u)

/** The number of GAP Peripheral configurations structures */
#define CY_BLE_GAP_PERIPHERAL_COUNT                 (0x01u)

/** The number of GAP Broadcaster configurations structures */
#define CY_BLE_GAP_BROADCASTER_COUNT                (0x00u)

/** The number of GAP Central configurations structures */
#define CY_BLE_GAP_CENTRAL_COUNT                    (0x00u)

/** The number of GAP Observer configurations structures */
#define CY_BLE_GAP_OBSERVER_COUNT                   (0x00u)

/** The number of Security configurations structures */
#define CY_BLE_AUTH_INFO_COUNT                      (0x01u)

/** The GAP security level */
#define CY_BLE_CONFIG_GAP_SECURITY_LEVEL            (0x01u)

/**
 * The GAP Role
 * The following defined masks can be used:
 * CY_BLE_GAP_PERIPHERAL, CY_BLE_GAP_CENTRAL, CY_BLE_GAP_BROADCASTER and CY_BLE_GAP_OBSERVER.
 */ 
#define CY_BLE_GAP_ROLE                             (0x01u)

/** The Bonding Requirement */
#define CY_BLE_BONDING_REQUIREMENT                  (0x00u)

/**
 * GATT MTU Size
 * The maximum Transmission Unit size (bytes) of an attribute to be used in the design.
 * The valid range is from 23 to 512 bytes. 
 */
#define CY_BLE_GATT_MTU                             (0x17u)

/** The GATT Maximum attribute length */
#define CY_BLE_GATT_DB_MAX_VALUE_LEN                (0x0026u)
#define CY_BLE_GATT_DB_INDEX_COUNT                  (0x0014u)

/** The number of characteristics supporting the Reliable Write property */
#define CY_BLE_GATT_RELIABLE_CHAR_COUNT             (0x0000u)

/** The total length of characteristics with the Reliable Write property */
#define CY_BLE_GATT_RELIABLE_CHAR_LENGTH            (0x0000u)

/** The size of the cy_ble_attValues array */
#define CY_BLE_GATT_DB_ATT_VAL_COUNT                (0x77u)

/** The size of the cy_ble_attValuesLen array */
#define CY_BLE_GATT_DB_ATT_VAL_LEN_COUNT            (0x09u)

/** GATT Role */
#define CY_BLE_GATT_ROLE                            (0x01u)
#define CY_BLE_GATT_DB_CCCD_COUNT                   (0x02u)
#define CY_BLE_ATT_UUID_128_COUNT                   (0x00u)

/** The GATT Role defines */
#define CY_BLE_GATT_ROLE_SERVER                     (0u != (CY_BLE_GATT_ROLE & CY_BLE_GATT_SERVER))
#define CY_BLE_GATT_ROLE_CLIENT                     (0u != (CY_BLE_GATT_ROLE & CY_BLE_GATT_CLIENT))

/** Max unique services in the project */
#define CY_BLE_MAX_SRVI                             (0x02u)

/** The parameter to enable the configuration of the L2CAP logical channels */
#define CY_BLE_L2CAP_ENABLE                         (0x01u)

/** L2CAP MTU Size */
#define CY_BLE_CONFIG_L2CAP_MTU                     (0x17u)

/** The number of L2CAP Logical channels */
#define CY_BLE_CONFIG_L2CAP_LOGICAL_CHANNEL_COUNT   (0x01u)

/** Number of L2CAP PSMs */
#define CY_BLE_CONFIG_L2CAP_PSM_COUNT               (0x01u)

/** LE 2 Mbps feature */
#define CY_BLE_CONFIG_ENABLE_PHY_UPDATE             (0x00u)

/** Radio power calibration feature */
#define CY_BLE_CONFIG_TX_POWER_CALIBRATION_ENABLE   (0x00u)

/** LL Privacy 1.2 feature */
#define CY_BLE_CONFIG_ENABLE_LL_PRIVACY             (0x01u)

#define CY_BLE_CONFIG_MAX_RESOLVABLE_DEVICES        (0x10u)
#define CY_BLE_CONFIG_MAX_WHITE_LIST_SIZE           (0x10u)

/** The maximum number of bonded devices to be supported by this device */
#define CY_BLE_CONFIG_MAX_BONDED_DEVICES            (0x00u)                                     
/** Max Tx payload size */
#define CY_BLE_CONFIG_LL_MAX_TX_PAYLOAD_SIZE        (0x1Bu)

/** Max Rx payload size */
#define CY_BLE_CONFIG_LL_MAX_RX_PAYLOAD_SIZE        (0x1Bu)

#if !defined(CY_BLE_SHARING_MODE)
/** BLE Sharing mode (OTA feature) */
#define CY_BLE_SHARING_MODE                         (CY_BLE_SHARING_NONE)
#endif

/*******************************************************************************
* Include memory calculation and BLE cores/mode macros
*******************************************************************************/

#if (CY_BLE_SHARING_MODE != CY_BLE_SHARING_IMPORT)
#include "cy_ble_sw_comp.h"
#endif  /* (CY_BLE_SHARING_MODE != CY_BLE_SHARING_IMPORT) */

#include "cy_ble_cfg_common.h"


/*******************************************************************************
* API Constants for BLE services 
*******************************************************************************/    

/* HIDS */
/** The maximum supported count of HID services for the GATT Server role */
#define CY_BLE_CONFIG_HIDSS_SERVICE_COUNT                      (0x00u)

