Infineon/Code-Examples-for-the-ModusToolbox-PSoC-6-SDK/CE225909_PSoC6_BatteryLevel_RTOS/GeneratedSource/cycfg_ble.h
/** The maximum supported count of HID reports for the GATT Server role */
#define CY_BLE_CONFIG_HIDSS_REPORT_COUNT                       (0x00u)
    
/** The maximum supported count of HID services for the GATT Client role */
#define CY_BLE_CONFIG_HIDSC_SERVICE_COUNT                      (0x00u)

/** The maximum supported count of HID reports for the GATT Client role */
#define CY_BLE_CONFIG_HIDSC_REPORT_COUNT                       (0x00u)

/** HIDS service indexes */


/** HIDS Report Characteristic indexes */



/* Battery Service */
/** The maximum supported count of BAS services for the GATT Server role */
#define CY_BLE_CONFIG_BASS_SERVICE_COUNT                       (0x01u)

/** The maximum supported count of BAS reports for the GATT Client role */
#define CY_BLE_CONFIG_BASC_SERVICE_COUNT                       (0x00u)

/** BAS service indexes. */
typedef enum
{
    CY_BLE_BATTERY_SERVICE_INDEX
}cy_en_ble_bass_indexes_t;

/* Environmental Sensing Service */
/** The maximum supported count of ESS characteristics for the GATT Client role */
#define CY_BLE_CONFIG_ESSC_TOTAL_CHAR_COUNT                    (0x00u)

/** The number of ESS characteristics for the GATT Server role */
#define CY_BLE_CONFIG_ESSS_TOTAL_CHAR_COUNT                    (0x00u)

/** The number of different ESS characteristics */
#define CY_BLE_CONFIG_ESS_CHAR_INST_COUNT                      (0x15u)


/* Automation IO Service */
/** The maximum supported count of AIOS characteristics for the GATT Client role */
#define CY_BLE_CONFIG_AIOSC_TOTAL_CHAR_COUNT                   (0x00u)

/** The number of AIOS characteristics for the GATT Server role */
#define CY_BLE_CONFIG_AIOSS_TOTAL_CHAR_COUNT                   (0x00u)

/** The number of different AIOS characteristics */
#define CY_BLE_CONFIG_AIOS_CHAR_INST_COUNT                     (0x03u)


/* Custom Service */
/** The maximum supported count of Custom services for the GATT Server role */
#define CY_BLE_CONFIG_CUSTOMS_SERVICE_COUNT                    (0x00u)

/** The maximum supported count of Custom services for the GATT Client role */
#define CY_BLE_CONFIG_CUSTOMC_SERVICE_COUNT                    (0x00u)

/** The size of the cy_ble_customSChar array */
#define CY_BLE_CONFIG_CUSTOMS_SERVICE_CHAR_COUNT               (0x00u)

/** The size of the cy_ble_customSDesc array */
#define CY_BLE_CONFIG_CUSTOMS_SERVICE_CHAR_DESCRIPTORS_COUNT   (0x00u)

/** The size of the cy_ble_customCChar array */
#define CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_COUNT               (0x00u)

/** The size of the cy_ble_customCDesc array */
#define CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_DESCRIPTORS_COUNT   (0x00u)

/** The size of the cy_ble_customCUuid128 array */
#define CY_BLE_CONFIG_CUSTOMC_UUID_128_COUNT                   (0x00u)

/** The size of the cy_ble_customUuid16 array */
#define CY_BLE_CONFIG_CUSTOMC_UUID_16_COUNT                    (0x00u)

/*
 * Below are the indexes and handles of the defined Custom Services and 
 * their characteristics.
 */


#define CY_BLE_SECURITY_CONFIGURATION_0_INDEX   (0x00u)
#define CY_BLE_ADV_PKT_0_INDEXFLAGS   (0x00u)
#define CY_BLE_ADV_PKT_0_INDEXSERVICE_UUID_16   (0x03u)
#define CY_BLE_SCN_PKT_0_INDEXLOCAL_NAME   (0x00u)
#define CY_BLE_PERIPHERAL_CONFIGURATION_0_INDEX   (0x00u)


/*******************************************************************************
* Services Enable defines
*******************************************************************************/

#define CY_BLE_BAS
#define CY_BLE_BAS_SERVER
#define CY_BLE_DIS
#define CY_BLE_DIS_SERVER


/*******************************************************************************  
* Service indexes (SRVI)
*******************************************************************************/

typedef enum
{
    CY_BLE_SRVI_GAP,
    CY_BLE_SRVI_GATT,

    #ifdef CY_BLE_ANCS_CLIENT
    CY_BLE_SRVI_ANCS,
    #endif /* CY_BLE_ANCS_CLIENT */
    
    #ifdef CY_BLE_ANS_CLIENT
    CY_BLE_SRVI_ANS,
    #endif /* CY_BLE_ANS_CLIENT */
    
    #ifdef CY_BLE_AIOS_CLIENT
    CY_BLE_SRVI_AIOS,
    #endif /* CY_BLE_AIOS_CLIENT */
    
    #ifdef CY_BLE_BAS_CLIENT
    CY_BLE_SRVI_BAS,
    CY_BLE_SRVI_BAS_END = (uint8_t)(CY_BLE_SRVI_BAS) + CY_BLE_CONFIG_BASC_SERVICE_COUNT - 1u,
    #endif /* CY_BLE_BAS_CLIENT */
    
    #ifdef CY_BLE_BCS_CLIENT
    CY_BLE_SRVI_BCS,
    #endif /* CY_BLE_BCS_CLIENT */
    
    #ifdef CY_BLE_BLS_CLIENT
    CY_BLE_SRVI_BLS,
    #endif /* CY_BLE_BLS_CLIENT */
    
    #ifdef CY_BLE_BMS_CLIENT
    CY_BLE_SRVI_BMS,
    #endif /* CY_BLE_BMS_CLIENT */
    
    #ifdef CY_BLE_CGMS_CLIENT
    CY_BLE_SRVI_CGMS,
    #endif /* CY_BLE_CGMS_CLIENT */

    #ifdef CY_BLE_CPS_CLIENT
    CY_BLE_SRVI_CPS,
    #endif /* CY_BLE_CPS_CLIENT */

    #ifdef CY_BLE_CSCS_CLIENT
    CY_BLE_SRVI_CSCS,
    #endif /* CY_BLE_CSCS_CLIENT */

    #ifdef CY_BLE_CTS_CLIENT
    CY_BLE_SRVI_CTS,
    #endif /* CY_BLE_CTS_CLIENT */

    #ifdef CY_BLE_CUSTOM_CLIENT
    CY_BLE_SRVI_CUSTOMS,
    CY_BLE_SRVI_CUSTOMS_END =(uint8_t)(CY_BLE_SRVI_CUSTOMS ) + CY_BLE_CONFIG_CUSTOMC_SERVICE_COUNT - 1u,
    #endif /* CY_BLE_CUSTOM_CLIENT */

    #ifdef CY_BLE_DIS_CLIENT
    CY_BLE_SRVI_DIS,
    #endif /* CY_BLE_DIS_CLIENT */

    #ifdef CY_BLE_ESS_CLIENT
    CY_BLE_SRVI_ESS,
    #endif /* CY_BLE_ESS_CLIENT */

    #ifdef CY_BLE_GLS_CLIENT
    CY_BLE_SRVI_GLS,
    #endif /* CY_BLE_GLS_CLIENT */
    
    #ifdef CY_BLE_HIDS_CLIENT
    CY_BLE_SRVI_HIDS,
    CY_BLE_SRVI_HIDS_END = (uint8_t)(CY_BLE_SRVI_HIDS)+ CY_BLE_CONFIG_HIDSC_SERVICE_COUNT - 1u,
    #endif /* CY_BLE_HIDS_CLIENT */

    #ifdef CY_BLE_HPS_CLIENT
    CY_BLE_SRVI_HPS,
    #endif /* CY_BLE_HPS_CLIENT */

    #ifdef CY_BLE_HRS_CLIENT
    CY_BLE_SRVI_HRS,
    #endif /* CY_BLE_HRS_CLIENT */

    #ifdef CY_BLE_HTS_CLIENT
    CY_BLE_SRVI_HTS,
    #endif /* CY_BLE_HTS_CLIENT */

    #ifdef CY_BLE_IAS_CLIENT
    CY_BLE_SRVI_IAS,
    #endif /* CY_BLE_IAS_CLIENT */

    #ifdef CY_BLE_IPS_CLIENT
    CY_BLE_SRVI_IPS,
    #endif /* CY_BLE_IPS_CLIENT */

    #ifdef CY_BLE_LLS_CLIENT
    CY_BLE_SRVI_LLS,
    #endif /* CY_BLE_LLS_CLIENT */

