Infineon/Code-Examples-for-the-ModusToolbox-PSoC-6-SDK/CE225909_PSoC6_BatteryLevel_RTOS/GeneratedSource/cycfg_ble.h
    #ifdef CY_BLE_LNS_CLIENT
    CY_BLE_SRVI_LNS,
    #endif /* CY_BLE_LNS_CLIENT */

    #ifdef CY_BLE_NDCS_CLIENT
    CY_BLE_SRVI_NDCS,
    #endif /* CY_BLE_NDCS_CLIENT */
    
    #ifdef CY_BLE_IPSS_CLIENT
    CY_BLE_SRVI_IPSS,
    #endif /* CY_BLE_IPSS_CLIENT */
    
    #ifdef CY_BLE_PASS_CLIENT
    CY_BLE_SRVI_PASS,
    #endif /* CY_BLE_PASS_CLIENT */

    #ifdef CY_BLE_PLXS_CLIENT
    CY_BLE_SRVI_PLXS,
    #endif /* CY_BLE_PLXS_CLIENT */

    #ifdef CY_BLE_RSCS_CLIENT
    CY_BLE_SRVI_RSCS,
    #endif /* CY_BLE_RSCS_CLIENT */

    #ifdef CY_BLE_RTUS_CLIENT
    CY_BLE_SRVI_RTUS,
    #endif /* CY_BLE_RTUS_CLIENT */

    #ifdef CY_BLE_SCPS_CLIENT
    CY_BLE_SRVI_SCPS,
    #endif /* CY_BLE_SCPS_CLIENT */

    #ifdef CY_BLE_TPS_CLIENT
    CY_BLE_SRVI_TPS,
    #endif /* CY_BLE_TPS_CLIENT */

    #ifdef CY_BLE_UDS_CLIENT
    CY_BLE_SRVI_UDS,
    #endif /* CY_BLE_UDS_CLIENT */

    #ifdef CY_BLE_WPTS_CLIENT
    CY_BLE_SRVI_WPTS,
    #endif /* CY_BLE_WPTS_CLIENT */

    #ifdef CY_BLE_WSS_CLIENT
    CY_BLE_SRVI_WSS,
    #endif /* CY_BLE_WSS_CLIENT */
    
    CY_BLE_SRVI_COUNT /**< Total count of services */
}cy_en_ble_srvi_t;


/*******************************************************************************
* External data references
*******************************************************************************/

extern const cy_stc_ble_config_t cy_ble_config;
extern cy_stc_ble_gap_bd_addr_t cy_ble_deviceAddress;


#if (CY_BLE_GATT_ROLE_SERVER) 
extern const cy_stc_ble_gaps_t cy_ble_gaps;
extern const cy_stc_ble_gaps_config_t cy_ble_gapsConfig;
extern const cy_stc_ble_gatts_t cy_ble_gatts;
extern const cy_stc_ble_gatts_config_t cy_ble_gattsConfig;
#endif /* CY_BLE_GATT_ROLE_SERVER */

#if (CY_BLE_GATT_ROLE_CLIENT) 
extern cy_stc_ble_gattc_t cy_ble_gattc[CY_BLE_GATTC_COUNT];
extern cy_stc_ble_gapc_t cy_ble_gapc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_gapc_config_t cy_ble_gapcConfig;
extern const cy_stc_ble_gattc_config_t cy_ble_gattcConfig;
extern cy_stc_ble_discovery_t cy_ble_discovery[CY_BLE_GATTC_COUNT];
extern cy_stc_ble_disc_srvc_info_t cy_ble_serverInfo[CY_BLE_GATTC_COUNT][CY_BLE_SRVI_COUNT];
#endif /* CY_BLE_GATT_ROLE_CLIENT */

#ifdef CY_BLE_ANCS_SERVER
extern const cy_stc_ble_ancss_t cy_ble_ancss;
extern const cy_stc_ble_ancss_config_t cy_ble_ancssConfig;
#endif /* CY_BLE_ANCS_SERVER */
#ifdef CY_BLE_ANCS_CLIENT
extern cy_stc_ble_ancsc_t cy_ble_ancsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_ancsc_config_t cy_ble_ancscConfig;
#endif /* CY_BLE_ANCS_CLIENT */

#ifdef CY_BLE_ANS_SERVER
extern const cy_stc_ble_anss_t cy_ble_anss;
extern const cy_stc_ble_anss_config_t cy_ble_anssConfig;
#endif /* CY_BLE_ANS_SERVER */
#ifdef CY_BLE_ANS_CLIENT
extern cy_stc_ble_ansc_t cy_ble_ansc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_ansc_config_t cy_ble_anscConfig;
#endif /* CY_BLE_ANS_CLIENT */

#ifdef CY_BLE_AIOS_SERVER
extern const cy_stc_ble_aioss_t cy_ble_aioss;
extern const cy_stc_ble_aioss_config_t cy_ble_aiossConfig;
#endif /* CY_BLE_AIOS_SERVER */
#ifdef CY_BLE_AIOS_CLIENT
extern const cy_stc_ble_aiosc_t cy_ble_aiosc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_aiosc_config_t cy_ble_aioscConfig;
#endif /* CY_BLE_AIOS_CLIENT */

#ifdef CY_BLE_BAS_SERVER
extern const cy_stc_ble_bass_t cy_ble_bass[CY_BLE_CONFIG_BASS_SERVICE_COUNT];
extern const cy_stc_ble_bass_config_t cy_ble_bassConfig;
#endif /* CY_BLE_BAS_SERVER */
#ifdef CY_BLE_BAS_CLIENT
extern cy_stc_ble_basc_t cy_ble_basc[CY_BLE_GATTC_COUNT][CY_BLE_CONFIG_BASC_SERVICE_COUNT];
extern const cy_stc_ble_basc_config_t cy_ble_bascConfig;
#endif /* CY_BLE_BAS_CLIENT */

#ifdef CY_BLE_BCS_SERVER
extern const cy_stc_ble_bcss_t cy_ble_bcss;
extern const cy_stc_ble_bcss_config_t cy_ble_bcssConfig;
#endif /* CY_BLE_BCS_SERVER */
#ifdef CY_BLE_BCS_CLIENT
extern cy_stc_ble_bcsc_t cy_ble_bcsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_bcsc_config_t cy_ble_bcscConfig;
#endif /* CY_BLE_BCS_CLIENT */

#ifdef CY_BLE_BLS_SERVER
extern const cy_stc_ble_blss_t cy_ble_blss;
extern const cy_stc_ble_blss_config_t cy_ble_blssConfig;
#endif /* CY_BLE_BLS_SERVER */
#ifdef CY_BLE_BLS_CLIENT
extern cy_stc_ble_blsc_t cy_ble_blsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_blsc_config_t cy_ble_blscConfig;
#endif /* CY_BLE_BLS_CLIENT */

#ifdef CY_BLE_BMS_SERVER
extern const cy_stc_ble_bmss_t cy_ble_bmss;
extern const cy_stc_ble_bmss_config_t cy_ble_bmssConfig;
#endif /* CY_BLE_BMS_SERVER */
#ifdef CY_BLE_BMS_CLIENT
extern cy_stc_ble_bmsc_t cy_ble_bmsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_bmsc_config_t cy_ble_bmscConfig;
#endif /* CY_BLE_BMS_CLIENT */

#ifdef CY_BLE_BTS_SERVER
extern const cy_stc_ble_btss_t cy_ble_btss;
extern const cy_stc_ble_btss_config_t cy_ble_btssConfig;
#endif /* CY_BLE_BTS_SERVER */

#ifdef CY_BLE_CGMS_SERVER
extern const cy_stc_ble_cgmss_t cy_ble_cgmss;
extern const cy_stc_ble_cgmss_config_t cy_ble_cgmssConfig;
#endif /* CY_BLE_CGMS_SERVER */
#ifdef CY_BLE_CGMS_CLIENT
extern cy_stc_ble_cgmsc_t cy_ble_cgmsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_cgmsc_config_t cy_ble_cgmscConfig;
#endif /* CY_BLE_CGMS_CLIENT */

#ifdef CY_BLE_CPS_SERVER
extern const cy_stc_ble_cpss_t cy_ble_cpss;
extern const cy_stc_ble_cpss_config_t cy_ble_cpssConfig;
#endif /* CY_BLE_CPS_SERVER */
#ifdef CY_BLE_CPS_CLIENT
extern cy_stc_ble_cpsc_t cy_ble_cpsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_cpsc_config_t cy_ble_cpscConfig;
#endif /* CY_BLE_CPS_CLIENT */

#ifdef CY_BLE_CSCS_SERVER
extern const cy_stc_ble_cscss_t cy_ble_cscss;
extern const cy_stc_ble_cscss_config_t cy_ble_cscssConfig;
#endif /* CY_BLE_CSCS_SERVER */
#ifdef CY_BLE_CSCS_CLIENT
extern cy_stc_ble_cscsc_t cy_ble_cscsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_cscsc_config_t cy_ble_cscscConfig;
#endif /* CY_BLE_CSCS_CLIENT */

#ifdef CY_BLE_CTS_SERVER
extern const cy_stc_ble_ctss_t cy_ble_ctss;
extern const cy_stc_ble_ctss_config_t cy_ble_ctssConfig;
#endif /* CY_BLE_CTS_SERVER */
#ifdef CY_BLE_CTS_CLIENT
extern cy_stc_ble_ctsc_t cy_ble_ctsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_ctsc_config_t cy_ble_ctscConfig;
#endif /* CY_BLE_CTS_CLIENT */

#ifdef CY_BLE_CUSTOM_SERVER
extern const cy_stc_ble_customs_t cy_ble_customSServ[CY_BLE_CONFIG_CUSTOMS_SERVICE_COUNT];
extern const cy_stc_ble_customs_config_t cy_ble_customsConfig;
#endif /* CY_BLE_CUSTOM_SERVER */
#ifdef CY_BLE_CUSTOM_CLIENT
extern const cy_stc_ble_customc_t cy_ble_customCServ[CY_BLE_CONFIG_CUSTOMC_SERVICE_COUNT];
extern const cy_stc_ble_customc_config_t cy_ble_customcConfig;
#endif /* CY_BLE_CUSTOM_CLIENT */

#ifdef CY_BLE_DIS_SERVER
extern const cy_stc_ble_diss_t cy_ble_diss;
extern const cy_stc_ble_diss_config_t cy_ble_dissConfig;
#endif /* CY_BLE_DIS_SERVER */
#ifdef CY_BLE_DIS_CLIENT
extern cy_stc_ble_disc_t cy_ble_disc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_disc_config_t cy_ble_discConfig;
#endif /* CY_BLE_DIS_CLIENT */

#ifdef CY_BLE_ESS_SERVER
extern const cy_stc_ble_esss_t cy_ble_esss;
extern const cy_stc_ble_esss_config_t cy_ble_esssConfig;
#endif /* CY_BLE_ESS_SERVER */
#ifdef CY_BLE_ESS_CLIENT
extern const cy_stc_ble_essc_t cy_ble_essc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_essc_config_t cy_ble_esscConfig;
#endif /* CY_BLE_ESS_CLIENT */

#ifdef CY_BLE_GLS_SERVER
extern const cy_stc_ble_glss_t cy_ble_glss;
extern const cy_stc_ble_glss_config_t cy_ble_glssConfig;
#endif /* CY_BLE_GLS_SERVER */
#ifdef CY_BLE_GLS_CLIENT
extern cy_stc_ble_glsc_t cy_ble_glsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_glsc_config_t cy_ble_glscConfig;
#endif /* CY_BLE_GLS_CLIENT */

#ifdef CY_BLE_HIDS_SERVER
extern const cy_stc_ble_hidss_t cy_ble_hidss[CY_BLE_CONFIG_HIDSS_SERVICE_COUNT];
extern const cy_stc_ble_hidss_config_t cy_ble_hidssConfig;
#endif /* CY_BLE_HIDS_SERVER */
#ifdef CY_BLE_HIDS_CLIENT
extern cy_stc_ble_hidsc_t cy_ble_hidsc[CY_BLE_GATTC_COUNT][CY_BLE_CONFIG_HIDSC_SERVICE_COUNT];
extern const cy_stc_ble_hidsc_config_t cy_ble_hidscConfig;
#endif /* CY_BLE_HIDS_CLIENT */

#ifdef CY_BLE_HPS_SERVER
extern const cy_stc_ble_hpss_t cy_ble_hpss;
extern const cy_stc_ble_hpss_config_t cy_ble_hpssConfig;
#endif /* CY_BLE_HPS_SERVER */
#ifdef CY_BLE_HPS_CLIENT
extern cy_stc_ble_hpsc_t cy_ble_hpsc[CY_BLE_GATTC_COUNT];
extern const cy_stc_ble_hpsc_config_t cy_ble_hpscConfig;
#endif /* CY_BLE_HPS_CLIENT */

